updating log to qwiklabs
